Documents/ДоговорНаПоставкуКомплектующих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ДоговорНаПоставкуКомплектующих</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыНаПоставкуСырья</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИтог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДоговорНаПоставкуКомплектующих/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорНаПоставкуКомплектующих.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорНаПоставкуКомплектующих.Дата КАК Дата,
	|	ДоговорНаПоставкуКомплектующих.Контрагент КАК Контрагент,
	|	ДоговорНаПоставкуКомплектующих.Номер КАК Номер,
	|	ДоговорНаПоставкуКомплектующих.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	ДоговорНаПоставкуКомплектующих.СуммаИтог КАК СуммаИтог
	|ИЗ
	|	Документ.ДоговорНаПоставкуКомплектующих КАК ДоговорНаПоставкуКомплектующих
	|ГДЕ
	|	ДоговорНаПоставкуКомплектующих.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора");
    ПредметДоговораЧ2 = Макет.ПолучитьОбласть("ПредметДоговораЧ2");
	ОбщаяСумма = Макет.ПолучитьОбласть("ОбщаяСуммаДоговора");
	ПорядокПередачи = Макет.ПолучитьОбласть("ПорядокПередачиТовара");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// вывод заголовка с номером документа итд
        ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// заполняю шапку документа
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Дата = Формат(Шапка.Параметры.Дата, "ДФ=dd.MM.yyyy");		
		Шапка.Параметры.ГенДиректор = Справочники.Сотрудники.НайтиПоРеквизиту("Должность",Справочники.Должности.НайтиПоНаименованию("Генеральный директор",Истина,"Совет директоров"));
		Шапка.Параметры.НаименованиеОрганизации = Константы.НазваниеОрганизации.Получить();
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		// Вывод области с писаниной
		ТабДок.Вывести(ПредметДоговора);
		
		// Вывод области ТЧ С товарами
		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		
		// вывод еще одной писанины часть 2	
		ТабДок.Вывести(ПредметДоговораЧ2);
		
		// область с расчетами общей суммы
		ОбщаяСумма.Параметры.ИтогДокумента = Выборка.СуммаИтог;
		ОбщаяСумма.Параметры.СуммаПрописью =  ЧислоПрописью(Выборка.СуммаИтог, "Л=ru_RU;ДП=Истина","рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
		ТабДок.Вывести(ОбщаяСумма);
		
		//   четвертая область вывода документа
		ТабДок.Вывести(ПорядокПередачи);
		
		  // пятая область подвала
		Подвал.Параметры.Контрагент = Выборка.Контрагент;
		Подвал.Параметры.ГенДиректор = Справочники.Сотрудники.НайтиПоРеквизиту("Должность",Справочники.Должности.НайтиПоНаименованию("Генеральный директор",Истина,"Совет директоров"));
		Подвал.Параметры.НаименованиеОрганизации = Константы.НазваниеОрганизации.Получить();
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
